InformationRegisters/ОчередиСообщенийОбменаСМобильнымиКлиентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОчередиСообщенийОбменаСМобильнымиКлиентами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СообщениеОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МобильныйКлиент</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.МобильноеПриложение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОчередиСообщенийОбменаСМобильнымиКлиентами/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	Попытка 
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	КОЛИЧЕСТВО(ОчередиСообщенийОбменаСМобильнымиКлиентами.НомерСообщения) КАК КоличествоСообщений
		|ИЗ
		|	РегистрСведений.ОчередиСообщенийОбменаСМобильнымиКлиентами КАК ОчередиСообщенийОбменаСМобильнымиКлиентами
		|ГДЕ
		|	ОчередиСообщенийОбменаСМобильнымиКлиентами.МобильныйКлиент = &МобильныйКлиент");
		
		Запрос.УстановитьПараметр("МобильныйКлиент", ЭтотОбъект.Отбор.МобильныйКлиент.Значение);
		
		Выборка = Запрос.Выполнить().Выбрать();

		КоличествоЗаписей = 0;	
		Если Выборка.Следующий() Тогда
			КоличествоЗаписей = Выборка.КоличествоСообщений;
		КонецЕсли;   

		ОбменМобильноеПриложениеПереопределяемый.ДобавитьЗаписьВЖурналОбмена(ЭтотОбъект.Отбор.МобильныйКлиент.Значение,  "Количество сообщений в очереди " + КоличествоЗаписей);	
	
	Исключение
	КонецПопытки; 


//	Попытка 

//		ВедетсяЛогПоУзлу = ЭтотОбъект.Отбор.МобильныйКлиент.Значение.ВестиЛогОбмена;

//		Если ВедетсяЛогПоУзлу Тогда

//			Для Каждого Запись Из ЭтотОбъект Цикл
//				МЗ = РегистрыСведений.МП_КопияОчередиСообщенийОбменаСМобильнымиКлиентами.СоздатьМенеджерЗаписи();

//				ЗаполнитьЗначенияСвойств(МЗ, Запись);

//				МЗ.Записать();
//			КонецЦикла;  

//		КонецЕсли; 
//		
//	Исключение
//	КонецПопытки; 

КонецПроцедуры
